app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    movies = Movie.all.sort_by { |movie| movie.year }

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    movie = Movie.find(params[:id])

INSERT INTO "movies" ("title", "year", "genre", "imageUrl", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "jaws"], ["year", "1985"], ["genre", "horror"], ["imageUrl", nil], ["created_at", "2023-05-31 00:00:23.911386"], ["updated_at", "2023-05-31 00:00:23.911386"]]
---
  def create
    movie = Movie.create!(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "movies" SET "title" = $1, "year" = $2, "genre" = $3, "updated_at" = $4 WHERE "movies"."id" = $5  [["title", "gone with the wind"], ["year", "1940"], ["genre", "action"], ["updated_at", "2023-05-31 00:06:22.595844"], ["id", 3]]
---
  def update
    movie = Movie.find(params[:id])
    movie.update!(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 2]]
---
  def destroy
    movie = Movie.find(params[:id])
    movie.destroy!